In [1]:
import pandas as pd

In [72]:
pd.read_csv("../data/orders.csv", encoding='latin1')

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10389,BOTTM,4,1995-01-20,1995-02-17,1995-01-24,2,47.42,Bottom-Dollar Markets,23 Tsawassen Blvd.,Tsawassen,BC,T2F 8M4,Canada
1,10390,ERNSH,6,1995-01-23,1995-02-20,1995-01-26,1,126.38,Ernst Handel,Kirchgasse 6,Graz,NaN,8010,Austria
2,10391,DRACD,3,1995-01-23,1995-02-20,1995-01-31,3,5.45,Drachenblut Delikatessen,Walserweg 21,Aachen,NaN,52066,Germany
3,10392,PICCO,2,1995-01-24,1995-02-21,1995-02-01,3,122.46,Piccolo und mehr,Geislweg 14,Salzburg,NaN,5020,Austria
4,10393,SAVEA,1,1995-01-25,1995-02-22,1995-02-03,3,126.56,Save-a-lot Markets,187 Suffolk Ln.,Boise,ID,83720,USA
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
825,11073,PERIC,2,1996-06-04,1996-07-02,NaN,2,24.95,Pericles Comidas clÃ¡sicas,Calle Dr. Jorge Cash 321,MÃ©xico D.F.,NaN,05033,Mexico
826,11074,SIMOB,7,1996-06-05,1996-07-03,NaN,2,18.44,Simons bistro,VinbÃ¦ltet 34,KÃ¸benhavn,NaN,1734,Denmark
827,11075,RICSU,8,1996-06-05,1996-07-03,NaN,2,6.19,Richter Supermarkt,Starenweg 5,GenÃ¨ve,NaN,1204,Switzerland
828,11076,BONAP,4,1996-06-05,1996-07-03,NaN,2,38.28,Bon app',"12, rue des Bouchers",Marseille,NaN,13008,France
829,11077,RATTC,1,1996-06-05,1996-07-03,NaN,2,8.53,Rattlesnake Canyon Grocery,2817 Milton Dr.,Albuquerque,NM,87110,USA

In [57]:
products_cols = ["ProductID","ProductName","CategoryID","UnitPrice","UnitsInStock","UnitsOnOrder","ReorderLevel","Discontinued"]
categories_cols = ["CategoryID","CategoryName"]
orders_cols = ["OrderID","CustomerID","OrderDate","ShipCountry"]

products = pd.read_csv("../data/products.csv", usecols=products_cols, encoding='latin1')
categories = pd.read_csv("../data/categories.csv", usecols=categories_cols, encoding='latin1')
orders = pd.read_csv("../data/orders.csv", usecols=orders_cols)
order_details = pd.read_csv("../data/order_details.csv")
locations = pd.read_csv("../data/customers.csv",usecols=['CustomerID', 'Country'])

In [58]:
display(products.head(3), categories.head(3), orders.head(3), order_details.head(3), locations.head(3))

,ProductID,ProductName,CategoryID,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
0,1,Chai,1,$18.00,39,0,10,0
1,2,Chang,1,$19.00,17,40,25,0
2,3,Aniseed Syrup,2,$10.00,13,70,25,0

   CategoryID CategoryName
0           1    Beverages
1           2   Condiments
2           3  Confections

   OrderID CustomerID   OrderDate ShipCountry
0    10389      BOTTM  1995-01-20      Canada
1    10390      ERNSH  1995-01-23     Austria
2    10391      DRACD  1995-01-23     Germany

   OrderID  ProductID  UnitPrice  Quantity  Discount
0    10248         11       14.0        12       0.0
1    10248         42        9.8        10       0.0
2    10248         72       34.8         5       0.0

  CustomerID  Country
0      ALFLI  Germany
1      ANATR   Mexico
2      ANTON   Mexico

In [59]:
display(products.info(),categories.info(),orders.info(),order_details.info(), locations.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ProductID     77 non-null     int64
 1   ProductName   77 non-null     object
 2   CategoryID    77 non-null     int64
 3   UnitPrice     77 non-null     object
 4   UnitsInStock  77 non-null     int64
 5   UnitsOnOrder  77 non-null     int64
 6   ReorderLevel  77 non-null     int64
 7   Discontinued  77 non-null     int64
dtypes: int64(6), object(2)
memory usage: 4.9+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CategoryID    8 non-null      int64
 1   CategoryName  8 non-null      object
dtypes: int64(1), object(1)
memory usage: 260.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   OrderID      830 non-null    int64
 1   CustomerID   830 non-null    object
 2   OrderDate    830 non-null    object
 3   ShipCountry  830 non-null    object
dtypes: int64(1), object(3)
memory usage: 26.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2155 entries, 0 to 2154
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   OrderID    2155 non-null   int64
 1   ProductID  2155 non-null   int64
 2   UnitPrice  2155 non-null   float64
 3   Quantity   2155 non-null   int64
 4   Discount   2155 non-null   float64
dtypes: float64(2), int64(3)
memory usage: 84.3 KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 91 entries, 0 to 90
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  91 non-null     object
 1   Country     91 non-null     object
dtypes: object(2)
memory usage: 1.6+ KB

None

None

None

None

None

### Cleaning Data

In [68]:
products["UnitPrice"] = products["UnitPrice"].str.replace("$","").astype("float64")

orders['OrderDate'] = pd.to_datetime(orders['OrderDate'])

### Merging the Dataframes

In [69]:
# display(orders.head(), order_details.head())
orders_sales = pd.merge(orders, order_details, on="OrderID")
orders_sales.head()

,OrderID,CustomerID,OrderDate,ShipCountry,ProductID,UnitPrice,Quantity,Discount
0,10389,BOTTM,1995-01-20,Canada,10,24.8,16,0.0
1,10389,BOTTM,1995-01-20,Canada,55,19.2,15,0.0
2,10389,BOTTM,1995-01-20,Canada,62,39.4,20,0.0
3,10389,BOTTM,1995-01-20,Canada,70,12.0,30,0.0
4,10390,ERNSH,1995-01-23,Austria,31,10.0,60,0.1

In [76]:
orders_sales_locations = pd.merge(orders_sales, locations, on="CustomerID")
orders_sales_locations = orders_sales_locations.rename({'Country':"OrderCountry"}, axis=1)
orders_sales_locations.head()

,OrderID,CustomerID,OrderDate,ShipCountry,ProductID,UnitPrice,Quantity,Discount,OrderCountry
0,10389,BOTTM,1995-01-20,Canada,10,24.8,16,0.0,Canada
1,10389,BOTTM,1995-01-20,Canada,55,19.2,15,0.0,Canada
2,10389,BOTTM,1995-01-20,Canada,62,39.4,20,0.0,Canada
3,10389,BOTTM,1995-01-20,Canada,70,12.0,30,0.0,Canada
4,10390,ERNSH,1995-01-23,Austria,31,10.0,60,0.1,Austria

In [80]:
sum(orders_sales_locations.ShipCountry != orders_sales_locations.OrderCountry)

0

In [83]:
# since ALL shipping coutries is the same as the order countries, I will drop one of the column
orders_sales_locations = orders_sales_locations.drop("ShipCountry", axis=1).rename({"OrderCountry":"Country"},axis=1)
orders_sales_locations.head(3)

,OrderID,CustomerID,OrderDate,ProductID,UnitPrice,Quantity,Discount,Country
0,10389,BOTTM,1995-01-20,10,24.8,16,0.0,Canada
1,10389,BOTTM,1995-01-20,55,19.2,15,0.0,Canada
2,10389,BOTTM,1995-01-20,62,39.4,20,0.0,Canada

In [71]:
products_with_categories = pd.merge(products, categories, on="CategoryID")
products_with_categories.head()

,ProductID,ProductName,CategoryID,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued,CategoryName
0,1,Chai,1,18.00,39,0,10,0,Beverages
1,2,Chang,1,19.00,17,40,25,0,Beverages
2,3,Aniseed Syrup,2,10.00,13,70,25,0,Condiments
3,4,Chef Anton's Cajun Seasoning,2,22.00,53,0,0,0,Condiments
4,5,Chef Anton's Gumbo Mix,2,21.35,0,0,0,1,Condiments

In [85]:
sum(products_with_categories.ProductID.duplicated())

0

In [86]:
products_analysis = pd.merge(orders_sales_locations, products_with_categories, on = "ProductID")
products_analysis.head(3)

,OrderID,CustomerID,OrderDate,ProductID,UnitPrice_x,Quantity,Discount,Country,ProductName,CategoryID,UnitPrice_y,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued,CategoryName
0,10389,BOTTM,1995-01-20,10,24.8,16,0.0,Canada,Ikura,8,31.0,31,0,0,0,Seafood
1,10389,BOTTM,1995-01-20,55,19.2,15,0.0,Canada,Pâté chinois,6,24.0,115,0,20,0,Meat/Poultry
2,10389,BOTTM,1995-01-20,62,39.4,20,0.0,Canada,Tarte au sucre,3,49.3,17,0,0,0,Confections